import { Fragment } from 'react';
// material
import { 
    Dialog,
    DialogActions,
    DialogContent,
    DialogContentText,
    DialogTitle,
    Button,
    Box,
    Link
} from '@mui/material';
// hooks
import useDialog from '../../../../hooks/useDialog';
// components
import { 
  Document,
  DocumentTitle,
  DocumentBlock,
  DocumentList,
  DocumentListItem,
} from '../../../content';
// ----------------------------------------------------------------------

export default function PrivacyPolicy() {

  const { open, openDialog, closeDialog } = useDialog();

  const handleClose = () => {
    closeDialog();
  }

  const handleOpen = () => {
    openDialog();
  }

  return (
   <Fragment>   

     <Link
      underline="always" 
      color="text.primary"
      onClick={handleOpen}
     > 
      سياسة الخصوصية
     </Link>
       
     <Dialog 
       open={open}
       onClose={handleClose}
       scroll="paper"
       aria-labelledby="scroll-dialog-title"
       aria-describedby="scroll-dialog-description"
     >

        <DialogTitle id="scroll-dialog-title"> 
          اتفاقية الشروط والأحكام الخاصة بمنصة شورى
        </DialogTitle>

        <DialogContent  dividers={true} >
            <DialogContentText>
              <Document>


              <DocumentBlock>
                  <DocumentTitle>
                     أولاً: معلومات المستخدم
                  </DocumentTitle>
                  <DocumentList>
                    <DocumentListItem>
                      1- {'باستعمال المستخدم لمنصة شورى فإنه يعد موافقًا على شروط سياسة الخصوصية، وتعد سياسة الخصوصية اتفاقية ملزمة قانونياً، وإذا تمت إضافة أي ميزات أو أدوات جديدة إلى خدمات المنصة، فستخضع أيضا لهذه السياسة.'}
                    </DocumentListItem>

                    <DocumentListItem>
                      2- {'تقوم المنصة بحفظ معلومات المستخدم الشخصية، وسيتم استخدامها والكشف عنها وفقا لما تسمح به الأنظمة والقوانين، وسوف يطلب موافقة المستخدم قبل استعمال معلوماته الشخصية لغير الأغراض الموضحة في سياسة الخصوصية.'}
                    </DocumentListItem>
                  </DocumentList>
                </DocumentBlock>



                <DocumentBlock>
                  <DocumentTitle>
                     أولاً: معلومات المستخدم
                  </DocumentTitle>
                  <DocumentList>
                    <DocumentListItem>
                     1-  {'تجمع المنصة من المستخدم البيانات التالية: اسمك، وعنوان بريدك الإلكتروني، ورقم هاتفك المحمول، وبيانات حسابك البنكي، وبيانات البطاقات الائتمانية، وحاجة المنصة إلى هذه المعلومات لتمكين المستخدم من الاستفادة من خدمات المنصة، وكذلك لمراقبة الاحتيال والمخاطر والامتثال للمتطلبات القانونية والتنظيمية السارية وفق ما تنص عليه أنظمة المملكة العربية السعودية.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     2-  {'يقر المستخدم بمنح منصة شورى صلاحية الدخول إلى الكاميرا ومكتبة الصور الخاصة به لرفع الوثائق المطلوبة ليتمكن من الاستفادة من خدمات منصة شورى بشكل أفضل.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     3-  {'باستعمال المستخدم لمنصة شورى فإنه يمنح المنصة صلاحية معرفة موقعه باستخدام خدمة الخرائط في الهاتف أو الجهاز الخاص به للسماح للمنصة بتقديم الخدمات على أكمل وجه.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     4-  {'تجمع المنصة المعلومات المتعلقة بالخدمات المقدمة، وقياس الأداء، ويتضمن ذلك معلومات عن نشاط المستخدم مثل: كيفية استخدام خدمات المنصة، وكيفية التفاعل مع الآخرين وغير ذلك.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     5-  {'تجمع المنصة معلومات خاصة بالجهاز عند تثبيت منصة شورى، ويتضمن ذلك معلومات مثل: نوع الجهاز، ومعلومات نظام التشغيل، ومعلومات المتصفح، وعنوان بروتوكول الإنترنت (IP Address)، ومعلومات شبكة الجوال، بما في ذلك رقم الهاتف ومعرفات الجهاز، ومعلومات مواقع الجهاز إذا منحت المنصة صلاحية الوصول للموقع.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     6-  {'تجمع المنصة المعلومات المتعلقة بطلب الخدمة وتقديمها والمحادثات التي تتم بين المستخدم وموفر الخدمة عبر منصة شورى.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     7-  {'تجمع المنصة المحادثات من مستخدمي الدردشة، وكذلك رقم الهاتف، وتسجل المكالمات من مستخدمي الدعم عبر الهاتف، وذلك لقياس الأداء ورفع مستوى الجودة.'}
                    </DocumentListItem>

                  </DocumentList>
                </DocumentBlock>

                <DocumentBlock>
                  <DocumentTitle>
                    ثانياً: معلومات من ملفات تعريف الارتباط وتقنية التعقب المشابهة
                  </DocumentTitle>

                  <DocumentList>

                    <DocumentListItem>
                     1- {'يتم إرسال ملفات تعريف الارتباط إلى الجهاز الخاص بالمستخدم من موقع على شبكة الانترنت ويتم تخزينها على جهازه، وتقوم المنصة بتخصيص ملف تعريف ارتباط مختلف لكل جهاز يتصل بمنصة شورى.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     2- {'تقوم المنصة باستخدام ملفات تعريف الارتباط للتعرف على جهاز المستخدم وتزويده بخدمات شخصية ولعرض إعلانات مخصصة من المتصفح أو من جهات أخرى.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     3- {'قد تستخدم المنصة تقنيات وأساليب التتبع الآلية أثناء إجراء الاتصالات مع المستخدم أو أثناء استخدامه للمنصة، وذلك لقياس الأداء وتحسين الخدمات.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     4- {'تقوم المنصة بتحليل واستخدام المعلومات التي لديها لتقييم وتحسين خدماتها والبحث والتطوير واختبار الخدمات والميزات الجديدة، وإجراء أنشطة استكشاف الأخطاء وإصلاحها، وتقوم أيضا باستخدام المعلومات الخاصة بالمستخدم للرد عليه وإفادته عند اتصاله.'}
                    </DocumentListItem>

                  </DocumentList>
                </DocumentBlock>

                <DocumentBlock>
                  <DocumentTitle>
                    ثالثًا: مشاركة المعلومات الشخصية مع طرف ثالث
                  </DocumentTitle>

                  <DocumentList>

                    <DocumentListItem>
                     1-  {'قد تلجأ المنصة لمشاركة معلومات المستخدم الشخصية مع طرف آخر وذلك للمساعدة في تطوير خدماتها وتحسينها وإصلاح المشاكل.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     2-  {'قد يطلب من المنصة في بعض الظروف من قبل الجهات الحكومية أو القضائية مشاركة المعلومات معهم أو مع طرف ثالث للتحقق من مطالبات قانونية أو لتلبية متطلبات الأمن الوطني أو لتنفيذ الأحكام القضائية، أو غيرها.'}
                    </DocumentListItem>      

                    <DocumentListItem>
                     3-  {'قد تقوم المنصة بمشاركة المعلومات الشخصية مع طرف ثالث للتحقيق أو لاتخاذ إجراءات بشأن الأنشطة الغير القانونية أو الاحتيالية المشتبه بها أو الحالات التي تنطوي على تهديدات محتملة للسلامة لأي شخص، أو في حالات انتهاكات بنود اتفاقية الشروط والأحكام وسياسة الخصوصية وحسب ما تقتضيه الأنظمة والقوانين.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     4-  {'قد تقوم المنصة أيضا بمشاركة المعلومات الشخصية مع الجهات التي تتملك منصة شورى مستقبلاً سواء بالاندماج أو الاستحواذ الكلي أو الجزئي، وفي حالة حدوث ذلك، فإن المنصة ستنشر إشعاراً على صفحتها الرئيسية.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     5-  {'قد تستخدم المنصة معلومات المستخدم العامة فقط، مثل (الاسم، بيانات التواصل، العمر، الجنس، مقر الإقامة، الحالة الاجتماعية)، والتي تجمعها منه للتسويق لخدماتها، وقد تقوم بتقديم هذه المعلومات التي تجمعها إلى شركات أخرى لتسويق منتجاتها وخدماتها، و ما عدا المعلومات العامة السابق ذكرها لا يمكن مشاركته.'}
                    </DocumentListItem>

                  </DocumentList>
                </DocumentBlock>

                <DocumentBlock>
                  <DocumentTitle>
                    رابعاً: أحكام عامة
                  </DocumentTitle>

                  <DocumentList>

                    <DocumentListItem>
                     1-  {'عند انتهاء علاقة المنصة مع المستخدم ستواصل المنصة تخزين النسخ المؤرشفة من معلومات المستخدم لأغراض تجارية ولالتزامها بالأنظمة والقوانين.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     2-  {'عند انتهاء علاقة المنصة مع المستخدم ستواصل تخزين المعلومات مجهولة المصدر مثل زيارات مواقع الويب بدون معرفات لتحسين خدماتها.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     3-  {'تحتفظ المنصة بمعلومات المستخدم بشكل آمن، وذلك باتباع معايير عالية في إدارة أمن المعلومات لحماية المعلومات الحساسة مثل المعلومات المالية وتفاصيل أي معلومات شخصية أخرى، وتطبق أنظمة أمن المعلومات الخاصة بها على الأشخاص والعمليات وأنظمة تكنولوجيا المعلومات على أساس إدارة المخاطر، ويقوم طرف ثالث مؤهل لإدارة، وسائل وآلية الدفع وتدقيقها.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     4-  {'تعمل المنصة على مستوى عالي من الأمان والسرية، وتستعمل في سبيل ذلك أفضل الوسائل الموجودة، وبالرغم من ذلك فإنه لا يمكن ضمان الأمان المطلق للمعلومات.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     5-  {'يمكن للمستخدم الاحتفاظ بجميع معلوماته الشخصية ومعلومات سجل عملياته ويمكنه الدخول إليها في أي وقت، كما تمنحه المنصة صلاحيات محددة من إعدادات حسابه للسماح له بتصحيح، أو تعديل، أو حذف، أو الحد من استخدام المعلومات الشخصية الخاصة به.'}
                    </DocumentListItem>

                    <DocumentListItem>
                     6-  {'قد يترتب على قيام المستخدم بحذف أو تقييد استخدام المعلومات الشخصية الخاصة به، تعطيل الاستفادة من خدمات المنصة بالشكل المرضي.'}
                    </DocumentListItem>


                  </DocumentList>
                </DocumentBlock>

              </Document>
            </DialogContentText>
        </DialogContent>

        <DialogActions>
          {/* <Button onClick={handleClose}>اوفق</Button> */}
          <Button onClick={handleClose}>اغلاق</Button>
        </DialogActions>

     </Dialog>
   </Fragment>   
  );
}
