import { Fragment } from 'react';
// material
import {
  Dialog,
  DialogActions,
  DialogContent,
  DialogContentText,
  DialogTitle,
  Button,
  Box,
  Link
} from '@mui/material';
// hooks
import useDialog from '../../../../hooks/useDialog';
// components
import {
  Document,
  DocumentTitle,
  DocumentBlock,
  DocumentList,
  DocumentListItem,
  DocumentText
} from '../../../content';
// ----------------------------------------------------------------------

export default function TermsService() {
  const { open, openDialog, closeDialog } = useDialog();

  const handleClose = () => {
    closeDialog();
  };

  const handleOpen = () => {
    openDialog();
  };

  return (
    <Fragment>
      <Link underline="always" color="text.primary" onClick={handleOpen}>
        شروط الخدمة
      </Link>

      <Dialog
        open={open}
        onClose={handleClose}
        scroll="paper"
        aria-labelledby="scroll-dialog-title"
        aria-describedby="scroll-dialog-description"
      >
        <DialogTitle id="scroll-dialog-title">
          الشروط والأحكام الخاصة باستخدام المحامين خدمات منصة شورى{' '}
        </DialogTitle>

        <DialogContent dividers={true}>
          <DialogContentText>
            <Document>
              <DocumentBlock>
                <DocumentTitle>أولاً: العلاقة التعاقدية:</DocumentTitle>

                <DocumentList>
                  <DocumentListItem>
                    {`يقصد بشروط وأحكام الاستخدام هذه (يشار اليها فيما بعد بـ "الشروط والاحكام") جميع الشروط والاحكام والسياسات والالتزامات الخاصة باستخدام خدمات منصة شورى التي تملكها شركة شورا لتقنية المعلومات، وهي شركة سعودية بموجب سجل تجاري رقم (٤٦٥٠٢٢٢٦٦٥) و(يشار إلى الشركة فيما بعد بـ" شورى") والمنصة هي عبارة عن تطبيق للهواتف المحمولة وموقع الكتروني  (ويشار إليها فيما بعد بـ"المنصة ") وهي منصة خاصة بمحامين المملكة العربية السعودية والغرض منها هو الوساطة بين المحامين والعملاء لتسهيل تقديم استشارات قانونية داخل المملكة العربية السعودية (ويشار إليها فيما بعد بـ"الخدمات") إلى العملاء عبر منصة شورى (ويشار إليهم فيما بعد ب "العميل" أو "العملاء") وفي جميع الأحوال فإن "المنصة" لها ذات المفهوم الخاص ب"شورى".`}
                  </DocumentListItem>
                  <Box>
                    <DocumentText>
                      • يُرجى قراءة الشروط والأحكام بعناية قبل الحصول على الخدمات أو استخدامها.
                    </DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`إن وصولك إلى الخدمات واستخدامها يعتبر موافقة منك على الالتزام بهذه الشروط، مما يُنشئ علاقة تعاقدية بينك وبين شركة شورى وفي حالة عدم موافقتك على هذه الشروط، لا يجوز لك الحصول على الخدمات أو استخدامها، وتحل هذه الشروط تحديداً محل أي اتفاقات أو ترتيبات سابقة أبرمت معك، ويجوز لشركة شورى إنهاء هذه الشروط أو أي من الخدمات التي تخصك على الفور أو بشكل عام أو إيقاف عرض الخدمات أو منع الوصول إليها أو إلى أي جزء منها في أي وقت ولأي سبب كان.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {`وقد يتم إضافة أو تطبيق بعض الشروط التكميلية على خدمات معينة، كالسياسات الخاصة بحدث أو نشاط أو حملة ترويجية معينة، وسيتم الإفصاح لك عن هذه الشروط التكميلية المتعلقة بالخدمات المقدمة، تُضاف الشروط التكميلية إلى الشروط والأحكام لأغراض الخدمات المقدمة، كما أنها تعتبر جزءاً منها، وتسود الشروط التكميلية على هذه الشروط في حالة التعارض فيما يتعلق بالخدمات المقدمة.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {`ويجوز لشورى تعديل أي من الشروط المتعلقة بالخدمات من حين إلى آخر وفق إرادتها المنفردة دون أي مسؤولية عليها، وتسري التعديلات ابتداء من نشر شورى هذه الشروط المحدثة أو المعدلة على المنصة أو نشر السياسات المعدلة أو الشروط التكميلية المتعلقة بالخدمة المقدمة، كما أن استمرار وصولك إلى الخدمات أو استخدامها بعد هذا النشر يعتبر موافقة منك على الالتزام بالشروط والأحكام بصيغتها المعدلة.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {` لشورى الحق في تقديم ما يلزم من المعلومات (بما في ذلك معلومات الاتصال الخاصة بك) إلى شركات تسوية المطالبات أو شركات ذات صلة بتقديم الخدمات وذلك في حال وجود شكوى أو نزاع أو خلاف حيث تكون هذه المعلومات أو البيانات ضرورية لتسوية الشكوى أو النزاع أو الخلاف. `}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>ثانياً: الخدمات:</DocumentTitle>

                <DocumentList>
                  <DocumentListItem>
                    {' '}
                    {`تُشكل خدمات شورى في تطبيقات الاجهزة المحمولة والموقع الالكتروني لتقديم خدمات الوساطة بين المحامين والعملاء لتسهيل وصول المحامين إلى العملاء وتقديم الاستشارات القانونية لهم.`}{' '}
                  </DocumentListItem>
                  <DocumentListItem>
                    {' '}
                    {`ينحصر دور شورى أنها مجرد وسيط بين المحامين والعملاء، ولا تضمن تقديم أي استشارات، ولا تتحمل أي مسؤولية عن أي أضرار، سواء مباشرة أو غير مباشرة تنشأ نتيجة تقديمكم للاستشارات، كما تقر بأنك المسؤول الوحيد عن أي التزام ينشأ عن ذلك.`}{' '}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`في إطار تقديم الخدمات تقوم شورى بتوفير وسيلة إلكترونية داخل منصة شورى، بحيث يكون دورها إيصال تفاصيل الاستشارة للمحامين وبيانات التواصل مع العميل على حسب جدول المحامي المدخل من قبله بالمنصة في حال كانت الاستشارة كتابية، أو بتحويل المكالمة للمحامي في حال كانت هاتفية.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {' '}
                    {`بعد قيام العميل بسداد قيمة الخدمات فإن شورى تقوم بتحويل قيمة الاستشارات التي تم استلام قيمتها، وذلك بعد خصم نسبتها من قيمة الاستشارات المقدمة خلال الشهر إلى المحامي وذلك خلال الخمسة أيام الأولى من بداية الشهر الميلادي التالي،`}{' '}
                  </DocumentListItem>
                  <DocumentListItem>
                    {' '}
                    {`في سبيل ضمان استمرارية تقديم الخدمات تقوم شورى بتوفير الدعم الفني اللازم على مدار 24 ساعة.`}{' '}
                  </DocumentListItem>
                  <DocumentListItem>
                    {' '}
                    {`تتعهد شورى بعدم إفشاء أسرار المحامي المتعلقة بموضوع الخدمات المقدمة، ولا يكشف عن هويته للعملاء، ما لم تكن هناك موافقة من قبلك. `}{' '}
                  </DocumentListItem>
                  <DocumentListItem>
                    {' '}
                    {`وفي حالة قيام العميل بطلب استشارات وأعمال أخرى معك فإنه سيتم تعيين منسق من قبل منصة شورى.`}{' '}
                  </DocumentListItem>

                  <Box>
                    <DocumentText>• الترخيص</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`تمنحك شورى شريطة امتثالك بهذه الشروط، ترخيصاً محدوداً غير حصري لا يمكن ترخيصه من الباطن ولا يمكن نقله إلى شخص آخر وهو قابل للإلغاء، من أجل: (1) الوصول إلى منصة شورى واستخدامها على جوالك أو الأجهزة الإلكترونية الأخرى فيما يتعلق باستخدامك للخدمات فقط؛ و(2) الوصول إلى أي من المحتويات والمعلومات والمواد ذات الصلة التي قد يتم توفيرها من خلال الخدمات واستخدامها، وتحتفظ شورى وأي من المرخصون التابعون لها بأي من الحقوق غير الممنوحة صراحة في هذه الشروط.`}{' '}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                  <Box>
                    <DocumentText>• القيود وحقوق الملكية</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`لا يحق لك إجراء ما يلي: (1) إزالة أيٍ من حقوق الطبع والنشر أو العلامات التجارية أو غيرها من إشعارات الملكية من أي جزء من الخدمات؛ أو (2) استنساخ الخدمات أو تعديلها أو إعداد أعمال مشتقة منها أو توزيعها أو ترخيصها أو تأجيرها أو بيعها أو إعادة بيعها أو نقل ملكيتها أو عرضها علانية أو أدائها علانية أو بثها أو تعميمها أو نشرها أو استغلالها بأي شكل آخر باستثناء ما تسمح به شورى صراحة وخطياً؛ أو (3) التلاعب بشفراتها أو عكس هندستها أو تفكيكها باستثناء ما تسمح به القوانين المطبقة؛ أو (4) إنشاء ارتباط لأي جزء من الخدمات أو إعداد نسخ مطابقة منها؛ أو (5) إنشاء أو التسبب في إنشاء أي برامج أو برامج نصية بغرض التخلص من أي جزء من الخدمات أو فهرسته أو مسحه أو استغلال بياناته بطريقة أخرى، أو إثقال أو إعاقة عمل و/أو وظيفة أي جانب من الخدمات على نحو غير ملائم؛ أو (6) محاولة الدخول بشكل غير مصرح به للخدمات أو إتلاف أي من جوانبها أو أي من الأنظمة والشبكات المتعلقة بها.`}{' '}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                  <Box>
                    <DocumentText>• خدمات الأطراف الخارجية ومحتواها</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`قد يتم توفير الخدمات أو إتاحة الوصول إليها بالاقتران بخدمات ومحتوى أطراف خارجية (بما في ذلك الإعلان) والتي لا تخضع لسيطرة شورى، وتقر بأنه قد تسري شروط استخدام وسياسات خصوصية مختلفة على استخدامك لخدمات ومحتوى الأطراف الخارجية، لا تُصادق شورى على خدمات ومحتوى الأطراف الخارجية ولا تتحمل بأي حال من الأحوال المسؤولية تجاه أي من منتجات أو خدمات مقدمي الخدمات الخارجيين، إضافة إلى ذلك، تعتبر شركة آبل أو شركة غوغل أو مايكروسوفت كوربوريشن على سبيل المثال لا الحصر و/أو شركاتهم التابعة والفرعية الدولية المعنية مستفيدين خارجيين لهذه الشروط إذا قمت بالوصول إلى الخدمات باستخدام التطبيقات المصممة خصيصاً لأجهزة الجوال التي تعمل بنظام Apple iOS أو Android أو Microsoft Windows ، على التوالي، أو غيرهم ممن يزاول مثل هذا النشاط أو يقدم مثل هذه الخدمات ولا يعتبر هؤلاء المستفيدون الخارجيون أطرافًا في هذه السياسة ولا يتحملون المسؤولية عن تقديم الخدمات أو دعمها بأي طريقة كانت، ويخضع وصولك إلى الخدمات باستخدام هذه الأجهزة إلى الشروط المنصوص عليها في شروط الخدمة المطبقة الخاصة بالمستفيد الخارجي.`}{' '}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                  <Box>
                    <DocumentText>• الملكية</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`تظل الخدمات وجميع الحقوق المتعلقة بها ملكية خاصة بشورى أو بمانحي التراخيص التابعين لها، ولا تمنحك هذه الشروط ولا استخدامك للخدمات أي حقوق: (1) في الخدمات أو فيما يتعلق بها بخلاف الترخيص المحدود الممنوح أعلاه؛ أو (2) لاستخدام أو الإشارة بأي طريقة إلى أسماء الشركات، أو الشعارات، أو أسماء المنتجات والخدمات، أو العلامات التجارية، أو علامات الخدمة الخاصة بشورى أو تلك الخاصة بالمرخصين التابعين لها.`}{' '}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>ثالثاً: استخدامك للخدمات:</DocumentTitle>
                <DocumentList>
                  <Box>
                    <DocumentText>• حسابات المستخدمين</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`من أجل استخدام الخدمات، يجب أن تقوم بالتسجيل من أجل الحصول على حساب شخصي فعّال لخدمات المستخدم والمحافظة عليه ("الحساب") ويجب أن تكون محامٍ معتمد وحامل لرخصة سارية لمزاولة مهنة المحاماة من الجهات المعنية بالمملكة العربية السعودية، ويتطلب تسجيل الحساب تقديم معلومات شخصية معينة إلى شورى كاسمك وعنوانك ورقم هاتفك الجوال وعمرك، وجميع البيانات الواردة بالهوية، صور من شهاداتك الجامعية والدراسات العليا (إن وجدت)، إضافة إلى بيانات الحساب البنكي الخاصة بك داخل المملكة العربية السعودية ليتم تحويل المستحقات من خلاله. وتوافق من جانبك على تدوين معلومات دقيقة وكاملة وحديثة في حسابك الخاص والمحافظة عليها. وقد يؤدي عدم حفاظك على وجود معلومات دقيقة وكاملة وحديثة في حسابك، بما في ذلك تعيين طريقة دفع غير صالحة أو منتهية الصلاحية، إلى عدم قدرتك على الوصول إلى الخدمات أو استخدامك لها أو إنهاء شورى لهذه الشروط والأحكام معك. تتحمل أنت المسؤولية عن جميع الأنشطة التي تُجرى باسم حسابك، كما توافق على الحفاظ على أمان وسرية اسم المستخدم وكلمة المرور الخاصين بحسابك طوال الوقت، لا يحق لك امتلاك أكثر من حساب واحد ما لم تسمح لك شورى كتابةً بخلاف ذلك. `}{' '}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                  <Box>
                    <DocumentText>• متطلبات المستخدم وسلوكه</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        {`لا تتوفر الخدمة للاستخدام من قبل الأشخاص غير الحاملين لرخصة مزاولة مهنة المحاماة، ولا يحق لك تفويض استخدام حسابك لأطراف خارجية، ولا يجوز لك التنازل عن حسابك أو نقل ملكيته إلى أي شخص أو كيان آخر، وتوافق من جانبك على الامتثال لجميع القوانين المعمول بها عند استخدام الخدمات ولا يجوز لك استخدامها إلا لأغراض قانونية.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {`يجب عليك أن تقوم بتقديم الاستشارات القانونية على أعلى مستوى من الجودة والكفاءة.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {`لا يجوز لك التواصل مع العملاء خارج منصة شورى أو دون علم المنسق الخاص بالمنصة.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {`كما أنك مسؤول مسؤولية تامة عن الاستشارات المقدمة من قبلك لعملاء المنصة.`}{' '}
                      </DocumentListItem>
                      <DocumentListItem>
                        {`يجب عليك القيام بدفع الغرامات والرسوم أو الضرائب التي تُفرض عليك بموجب الشروط والأحكام أو ما قد تفرضها عليك الجهات المختصة مستقبلاً والتي لم يتم حسمها من قبل شورى، كما أنك تتحمل كافة التعويضات والغرامات، في حال كانت الاستشارة المقدمة من قبلك للعميل غير سليمة أو نتج عنها أي تضرر أو تعويض.`}{' '}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك أن تقدم الاستشارات القانونية للعملاء بشكل شخصي، وفي حال تم تقديم الاستشارات من قبل أي طرف ثالث من خلالك؛ فإنك تتحمل المسؤولية الكاملة عن تقديمها.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك أيضاً طوال فترة فاعلية حسابك بأن تكون على أتم الجاهزية لاستقبال أي استشارة تقدم إليك من خلال المنصة، سواء كتابية أو هاتفية.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك أن تلتزم بكافة الأنظمة واللوائح والتعليمات المطبقة بالمملكة العربية السعودية، وكافة الشروط والأحكام الخاصة بالمنصة.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`بموجب الأحكام والشروط هذه فإنك تقر بأنك مستوفٍ لجميع الشروط والتراخيص والتصاريح اللازمة للاستفادة من تقديم الخدمات، وكذلك الامتثال لأي تصاريح أو تراخيص قد تفرض مستقبلًا.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يتحتم عليك القيام بتقديم تقرير شهري للمنصة عما توصلت إليه مع العملاء من خلال النموذج المعد لذلك على المنصة.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`ينبغي عليك القيام بالرد خلال مدة أقصاها (1 ساعة) بالموافقة أو بالرفض على قبول تقديم الاستشارة الكتابية وإلا سوف يتم تحويل الاستشارة إلى محامي آخر.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك بعد القبول بتقديم الاستشارة الكتابية، أو اي من الخدمات القانونية على سبيل المثال لا الحصر (مراجعة العقود، أو صياغة العقود للعميل) أن تقوم بتقديمها للعميل خلال (3-5) أيام عمل، ما لم يتم التعميد بمدة أقل أو أكثر من ذلك.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك قبول الاستشارة القانونية الهاتفية المحولة من قبل خدمة العملاء خلال مدة أقصاها (15) دقيقة، وفي حال التأخر في الرد سيتم إحالة الاستشارة الى محامي آخر.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك الاتصال في موعد تقديم الاستشارة المحدد، وفي حال عدم التزامك بتقديم الاستشارة أو التأخر في تقديمها لمدة تزيد عن 15 دقيقة سيتم اشعارك بالإنذار الأول للمرة الأولى وخصم قيمة الاستشارة، وفي حال تكرار المخالفة مرتين يتم اشعارك بإنذار ثاني وفي حال تكرار المخالفة ثلاث مرات يكون للمنصة الحق في تجميد حسابك مؤقتاً لمدة شهر أو تجميد حسابك بشكل دائم  مع أحقية شورى في تحويل الاستشارة الهاتفية إلى محامي أخر.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك الالتزام بتقديم الاستشارة القانونية الهاتفية على أن تكون مدة المكالمة لتقديم للاستشارة وهي (20 – 25) دقيقة.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك الالتزام بالوقت المحدد لتنفيذ العمل المطلوب للعميل، وفي حال عدم استطاعتك على اداء العمل، يجب عليك اخذ موافقة العميل، وفي حال تعذر اداء العمل او اخذ موافقة العميل يلتزم المحامي بتعويض شورى والعميل عن الأضرار التي أصابته دون أدنى مسؤولية على شورى.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`يجب عليك في حال تعذرك عن اداء الاستشارة القانونية الهاتفية في الوقت المحدد، بإخطار شورى قبل وقت الاستشارة بساعة كحد أدنى من خلال الأيقونة المعدة لذلك في المنصة.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`تقر بأن للمنصة الحق في تسجيل المكالمات الهاتفية بينك وبين العميل لحفظ الجودة والتأكد من الامتثال لهذه الشروط والأحكام.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`تقر بالاطلاع على دليل المكالمات الخاص بالمنصة والالتزام بما نص عليه والذي يتضمن المعايير التي يتحتم عليك إتباعها عند تقديم الاستشارات الهاتفية، كما أنك تقر بعلمك التام وموافقتك على قيام المنصة بتسجيل المكالمات الهاتفية لضمان جودة الخدمات المقدمة.`}
                      </DocumentListItem>{' '}
                      <DocumentListItem>
                        {`المنصة ستقوم بتقييم الاستشارات القانونية المقدمة منك وذلك من خلال فريق عملها بشكل دوري كل شهر. `}
                      </DocumentListItem>{' '}
                    </DocumentList>
                  </Box>
                  <Box>
                    <DocumentText>• الرسائل النصية</DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        بمجرد إنشاء الحساب، فأنت توافق على أن شورى قد ترسل إليك بعض الرسائل النصية
                        المعلوماتية كجزء من سياق الأعمال الطبيعي لاستخدامك للخدمات والتي قد تضمن
                        إرسال رمز الدخول الأمن المؤقت. ويحق لك رفض تلقي الرسائل النصية من شورى في أي
                        وقت وذلك عن طريق إرسال رسالة إلى البريد الإلكتروني{' '}
                        <a
                          style={{
                            color: '#d49e24',
                            fontWeight: 'bold'
                          }}
                          href="mailto:info@shwra.sa"
                        >
                          info@shwra.sa
                        </a>{' '}
                        توضح فيها عدم رغبتك في تلقي مزيد من هذه الرسائل مع تضمين رقم الجوال الذي
                        يتلقى هذه الرسائل، وتقر من جانبك بأن رفض تلقي الرسائل النصية قد يؤثر على
                        استخدامك للخدمات.{' '}
                      </DocumentListItem>
                    </DocumentList>
                  </Box>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>رابعاً: الرسوم وآلية الدفع:</DocumentTitle>
                <DocumentList>
                  <DocumentListItem>
                    {`
                  تتفهم من جانبك أن استخدام الخدمات سوف يؤدي إلى فرض رسوم عليك في مقابل الخدمات التي
                  تحصل عليها ("الرسوم") وبعد أن تتلقى الخدمات المتحصل عليها من خلال استخدامك للخدمة،
                  وستشمل الرسوم الضرائب المعمول بها بحسب ما ينص عليه القانون، وتكون جميع الرسوم التي
                  تدفعها نهائية وغير قابلة للاسترداد، ما لم تحدد شورى خلاف ذلك.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`في ضوء الخدمات المقدمة فإنه سيتم تحويل مبالغ الاستشارات والخدمات القانونية الينا من خلال العملاء وبدورنا سنقوم بتحويل مبلغ الأتعاب بداية كل شهر ميلادي على حسابك البنكي الذي قمت بتزويدنا به.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`وكما هو متفق عليه بينك وبين شورى، تحتفظ شورى بحقها في إنشاء و/أو إلغاء و/أو مراجعة الرسوم الخاصة بأي من الخدمات التي يتم الحصول عليها أو جميعها من خلال استخدام الخدمات في أي وقت وفقًا لتقدير شورى المطلق علاوة على ذلك، فإنك تقر وتقبل بأنه يجوز زيادة الرسوم المطبقة من وقت لأخر، وستبذل شورى جهوداً معقولة لإخطارك بالرسوم التي قد تنطبق عليك شريطة أن تتحمل المسؤولية عن الرسوم المتكبدة في حسابك بغض النظر عن درايتك بها أو بالمبالغ الخاصة بهذا الحساب. يحق لشورى من حين إلى آخر أن تزود بعض المستخدمين المحامين بالعروض والخصومات التي قد ينتج عنها مبالغ متفاوتة يتم دفعها للحصول على نفس الخدمات أو للحصول على خدمات مماثلة أثناء استخدام الخدمات وتوافق من جانبك على ألا يكون لهذه العروض والخصومات - ما لم تُتاح لك أيضاً- علاقة باستخدامك للخدمات أو الرسوم المحتسبة عليك.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`سيتم تحويل مبلغ وقدره 90 ريال سعودي (تسعون ريال سعودي) إليك عن الاستشارة الواحدة، كما تحتفظ شورى بحقها في تعديل هذه القيمة بإرادتها المنفردة، كما يحق لها عمل عروض ترويجية وتخفيضات ويلتزم المحامي بها متى ما جاوز دخله الشهري من شورى مبلغ لا يقل عن 3,000 ريال.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`تستحق شورى نسبة وقدرها (%20) عشرون بالمائة من أتعاب المحامي المدفوعة من العميل في حال استمرار العميل في العمل مع المحامي على مهام أخرى .`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`تستحق شركة شورى نسبة وقدرها (%20) من الاتعاب في حال أن العميل الذي تم تحويله من قبل شركة شورى الى المحامي اتى بعميل آخر.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`كافة المدفوعات التي تقوم بسدادها إلى منصة شورى يجب أن تكون من خلال تحويل بنكي على الحساب التالي: SA7310000001400003072903  البنك الأهلي،  كما أنك تتعهد بإدراج بيانات الحساب البنكي الخاصة بالمنصة في أي تعاقد يتم إبرامه مستقبلاً بينك وبين العملاء.`}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>خامساً: حقوق الملكية الفكرية:</DocumentTitle>
                <DocumentList>
                  <DocumentListItem>
                    {`جميع حقوق الملكية الفكرية، والتي تشمل على سبيل المثال: (الصور والرسومات والنصوص والشعارات ومقاطع الصوت ومقاطع الفيديو وتصميم الصفحة والبرمجيات والأدوات وحقوق النشر)؛ كلها مملوكة لشورى، ولا يجوز لك إعادة نسخها، أو تسجيلها، أو نشرها، أو استخدامها، أو القيام بأي تصرف فيها إلا بعد الحصول على موافقة خطية من قبل شورى.`}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>سادساً: السرية:</DocumentTitle>
                <DocumentList>
                  <DocumentListItem>
                    {`يجب عليك الالتزام طوال مدة فاعلية حسابك، وبعد تجميده لمدة (20) عشرون سنة؛ بالمحافظة التامة على سرية العمل والمعلومات التي اطلعت عليها بحكم طبيعة العمل، أو تمكنت من الوصول إليها، أو أصبحت معلومة في سياق تنفيذ هذه الشروط والأحكام، و تكون متعلقة بعمل أو معلومات أو الأسرار التجارية التي تم تطويرها أو اكتسبها شورى و لها صلة بالخدمات، على سبيل المثال: المعلومات (سواء تم تحديد أنها سرية أو غير سرية وتشمل جميع المعلومات المكتوبة أو الشفهية)، والإجراءات، والاستراتيجيات الخاصة بشركة شورى أو عملائها بما فيها أسرار العمل، و أسرار القضايا، و الاستشارات للعملاء، و المعلومات المالية، و الأسعار، و خطط الأعمال التجارية، و التسويق، و جميع المراسلات التي بين الطرفين، المستندات الموقعة بين الطرفين، و أسعار المنتجات و الكميات المتوفرة.`}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>سابعاً: المراسلات:</DocumentTitle>
                <DocumentList>
                  <DocumentListItem>
                    {`يتم تبادل الإشعارات والمراسلات من خلال البريد الالكتروني المزود من قبلك، وتعتبر منتجة لآثارها، كما أن اللغة المعتمدة في المراسلات هي اللغة العربية. في حال تم تغيير البريد الكتروني فيلتزم المحامي بإضافة ذلك التعديل على المنصة والا عد البريد الالكتروني المسجل هو المعتد به نظاماً.`}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>ثامناً: تعليق العمل بحسابك:</DocumentTitle>

                <DocumentList>
                  <DocumentListItem>
                    {`يحق لنا تعليق حسابك وإلغاء الاشتراك بشرط اخطارك خطياً قبل تعليق الحساب ب (7) أيام ما لم تقتضي الحالة الإيقاف الفوري على ان يتم تسوية جميع الأمور المالية والمحاسبية خلال مدة أقصاها 30 يوم.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`يحق لك إنهاء التعامل واغلاق الحساب وإلغاء اشتراكك بشرط اخطارنا خطياً قبل تعليق الحساب وإلغاء الاشتراك ب (60) ستين يوماً على أن يتم تسوية كافة الأمور المالية والمحاسبية خلال مدة أقصاها 30 يوم.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`يحق لنا إنهاء الحساب او التعامل بأثر فوري في أي وقت بإيقاف استخدامك لمنصة شورى، وذلك في حال قيامك بأي مما يلي: (أ- انتهاك أو خرق أي شرط من هذه الشروط والاحكام، ب- إذا رأينا أنك تسيء استخدام منصة شورى)، وإننا غير ملزمين بإرسال إخطار أو إنذار قبل وقف الحساب وإلغاء اشتراكك كما تتحمل أنت المسؤولية الكاملة عن الاضرار المادية والأدبية الناتجة عن هذا الإخلال.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`يجوز لنا ولك أنهاء التعامل في حال وجود قوة قاهرة أو في حال تصفية أو إفلاس أو اعسار أي مننا مع عدم الإخلال بالحقوق النظامية والمالية والشرعية للآخر.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`يحق لنا تعليق حسابك وإلغاء اشتراك حسابك عند الاخفاق من قبلك في تحقيق مؤشرات الأداء حسب تقديرنا أو أن يكون من شأن مواصلة استخدام شورى من قبلك أن يعرضنا أو يعرض مستخدمي شورى الآخرين إلى أي خطر محدق عند إنهاء حسابك سيتم إنهاء سجل الحساب الخاص بك.`}
                  </DocumentListItem>

                  <Box>
                    <DocumentText>
                      كما أن أي إنهاء لهذه الـشروط والاحكام مهما كان سببه يجب ألا:
                    </DocumentText>

                    <DocumentList>
                      <DocumentListItem>
                        1- {`يؤثر على أي حقوق أو التزامات مستحقة لأي من الطرفين.`}
                      </DocumentListItem>
                      <DocumentListItem>
                        2-{' '}
                        {`يؤثر على أي حكم من أحكام هذه الشروط والاحكام الذي يُنص صراحةً أو ضمناً على سريانه أو الإنهاء.`}
                      </DocumentListItem>
                      <DocumentListItem>3- {`يتطلب أمر من المحكمة المختصة.`}</DocumentListItem>
                    </DocumentList>
                  </Box>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>تاسعاً: استقلالية الأحكام والشروط:</DocumentTitle>

                <DocumentList>
                  <DocumentListItem>
                    {`لا يؤثر بطلان أي حكم من أحكام هذه الشروط والاحكام على صحة باقي الأحكام الأخرى الواردة فيها، وفي حالة وجود أي حكم باطل في شروط وأحكام المورد الماثلة أو وجود حكم غير مقبول في ظروف معينة وفقًا لمعايير المعقولية والعدالة وإلى هذا المدى فقط، يُعمل بدلاً منه بين الطرفين بحكم يكون مقبولاً مراعاةً لجميع الظروف ويتوافق مع أحكام الشرط الباطل قدر الإمكان مع مراعاة محتوى هذه الشروط والاحكام وغرضها.`}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>عاشراً: القانون واجب التطبيق:</DocumentTitle>

                <DocumentList>
                  <DocumentListItem>
                    {`تخضع تنفيذ وتفسير جميع الشروط والأحكام هذه وفقاً للأنظمة واللوائح السارية والمعمول بها في المملكة العربية السعودية.`}
                  </DocumentListItem>
                  <DocumentListItem>
                    {`وفي حال حدوث نزاع – لا سمح الله – فإنه يتم حله وديًا خلال ستون (60) يومًا من تاريخ إشعار أحد الأطراف للطرف الآخر بالنزاع، وفي حال تعذر ذلك يتم إحالته للمحكمة المختصة بمدينة الرياض.`}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>الحادي عشر: القوة القاهرة: </DocumentTitle>
                <DocumentList>
                  <DocumentListItem>
                    {`في حالة عجز أي من الطرفين عن الوفاء بأي من التزاماته نتيجة لقوة قاهرة، على سبيل المثال: الزلازل، و الأوبئة، و الحروب، عطل في وسائل الاتصال الإلكترونية بسبب مشاكل تقنية دولية، فيتم تعليق الخدمات، ويجب على الطرف المتضرر تقديم إشعار كتابي على الفور إلى الطرف الآخر بتاريخ بدء حالة القوة القاهرة، و مدى تأثيرها على التنفيذ، وإذا استمر حدوث القوة القاهرة لأكثر من ستون (60) يوما  متصلة أو بلغ مجموع أيامها أكثر من تسعون (90) يوماً متفرقة فإنه يتعين على كلا الطرفين تحديد اجتماع فيما بينهما عبر أي وسيلة، و مناقشة الأمر بحسن نية، و اتخاذ الإجراءات المناسبة للطرفين، وفي حال عدم اتفاق الطرفين على ذلك، فإنه سيستمر تعليق الخدمات لحين انتهاء فترة القوة القاهرة.`}{' '}
                  </DocumentListItem>
                </DocumentList>
              </DocumentBlock>

              <DocumentBlock>
                <DocumentTitle>الثاني عشر: احكام عامة:</DocumentTitle>

                <Box>
                  <DocumentText>• تقر وتوافق بأنه</DocumentText>

                  <DocumentList>
                    <DocumentListItem>
                      1- {`لا تؤثر عناوين مواد هذه الشروط والاحكام على تفسيرها.`}
                    </DocumentListItem>
                    <DocumentListItem>
                      2-{' '}
                      {`لا يعد ترك أي طرف لأي حق من حقوقه تنازلاً منه عن هذا الحق، ويجوز لصاحب الحق المطالبة به في أي وقت بناء على إرادته المنفردة.`}
                    </DocumentListItem>
                  </DocumentList>
                </Box>
              </DocumentBlock>
            </Document>
          </DialogContentText>
        </DialogContent>

        <DialogActions>
          {/* <Button onClick={handleClose}>اوفق</Button> */}
          <Button onClick={handleClose}>اغلاق</Button>
        </DialogActions>
      </Dialog>
    </Fragment>
  );
}
